#Операнды арифметического выражения записаны в системах счисления с основаниями 7 и 9:
#yx3207 + 1x3y39.
#В записи чисел переменными x и y обозначены допустимые в данных системах счисления неизвестные цифры. Определите 
#значения x и y, при которых значение данного арифметического выражения будет наименьшим и кратно 181. Для найденных 
#значений x и y вычислите частное от деления значения арифметического выражения на 181 и укажите его в ответе в десятичной 
#системе счисления. Основание системы счисления в ответе указывать не нужно.