#Сколько единиц содержится в двоичной записи значения выражения: 4**2015+2**2016−5? bank-ege.ru id:877
print (bin(4**2015 + 2**2016 - 5)[2:].count('1'))

